---
kind: method
id: M:Autodesk.Revit.DB.FamilyParameterSet.ReverseIterator
source: html/462072a5-96d2-37fe-45f8-6ccda997e2c3.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual FamilyParameterSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.